test/site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no
#+MACRO: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]

*** Hard line break wrong case (TOML)                                  :toml:
:PROPERTIES:
:EXPORT_FILE_NAME: blackfriday-ext-hardlinebreak-wrong-case-toml
:EXPORT_DATE: 2017-08-02
:EXPORT_HUGO_BLACKFRIDAY: :extensions hardlinebreak
:END:
The Blackfriday =hardLineBreak= extension is enabled here even where
user used the wrong case in the extension name:
#+BEGIN_EXAMPLE
:EXPORT_HUGO_BLACKFRIDAY: :extensions hardlinebreak
#+END_EXAMPLE
instead of:
#+BEGIN_EXAMPLE
:EXPORT_HUGO_BLACKFRIDAY: :extensions hardLineBreak
#+END_EXAMPLE

The Blackfriday extension names are case-sensitive. So even though,
the wrong case is used in the Org property drawer, =ox-hugo= ensures
that the Markdown front matter is written in the correct case!
:raised_hands:.

a
b
c

Above, /a/, /b/ and /c/ must appear on separate lines.
